import styles from './styles.module.scss'

export default async function Page() {
  return (
    <main className={styles.privacyPolicy}>
      <div className="container">
        <h2>Политика конфиденциальности</h2>
        <section>
          <h6>Дата размещения: 13 августа 2024 г.</h6>
          <p>
            Настоящая Политика конфиденциальности регулирует порядок обработки и использования персональных и иных
            данных
            между компанией ЧП “Веб продвижение” (УНП 491328985) (<span className="bold">«Компания»</span>), владеющей приложением FitAssist,
            размещенным в интернет магазине Apple AppStore и Google Play (<span className="bold">«Приложение»</span>), и Пользователем данного
            Приложения (<span className="bold">«Пользователь»</span>, <span className="bold">«Вы»</span>).
          </p>
          <p> Передавая Компании персональные и иные данные через Приложение, Пользователь подтверждает свое согласие на
            использование указанных данных на условиях, изложенных в настоящей Политике конфиденциальности.
            </p>
          <p className='bold'>
            Если Пользователь не согласен с условиями настоящей Политики конфиденциальности, он должен прекратить
            использование Приложения.
          </p>
          <p className='bold'>
            Безусловным принятием настоящей Политики конфиденциальности является начало использования Пользователем
            Приложения.
          </p>
        </section>
        <section>
          <h6>1. ТЕРМИНЫ</h6>
          <p>
            1. <span className="bold">Приложение</span> – это приложение, находящееся в интернет-магазине Apple AppStore и Google Play, называемое
            FitAssist и доступное для загрузки на официальном сайте по адресу https://fitassist.ru/. Все исключительные
            права на Приложение и его отдельные элементы (включая программное обеспечение, дизайн) принадлежат Компании
            в
            полном объеме. Передача исключительных прав Пользователю не подпадает под действие настоящей Политики
            конфиденциальности.
          </p>
          <p>
            2. <span className="bold">Пользователь</span> – это лицо, использующее Приложение.
          </p>
          <p>
            3. <span className="bold">Клиент</span> – это категория Пользователя, имеющего свой личный профиль в Приложении и использующего Приложение
            для общения с другими Пользователями, обмена информацией, ведения журнала своих тренировок с возможностью
            использования платных услуг, предоставляемых Платформой или Тренером.
          </p>
          <p>
            4. <span className="bold">Тренер</span> – это категория Пользователя, имеющего свой личный профиль в Приложении и использующего Приложение
            для общения с другими Пользователями, обмена информацией с возможностью предоставления платных услуг.
          </p>
          <p>
            5. <span className="bold">Платные услуги</span> – услуги, предоставляемые Платформой или Тренерами на основании <span className="bold">Пользовательского
            соглашения</span>.
          </p>
          <p>
            6. <span className="bold">Законодательство</span> – действующее законодательство Республики Беларусь.
          </p>
          <p>
            7. <span className="bold">Персональные данные</span> – это персональные данные Пользователя, которые Пользователь предоставляет о себе при
            Регистрации или в процессе использования функционала Приложения.
          </p>
          <p>
            8. <span className="bold">Данные</span> – это другие данные о Пользователе (не включенные в понятие Персональных данных).
          </p>
          <p>
            9. <span className="bold">Регистрация</span> – это создание нового аккаунта Пользователя в Приложении путем ввода информации, необходимой
            для регистрации в регистрационной форме.
          </p>
          <p>
            10. <span className="bold">Регистрационная форма</span> – это форма, находящаяся в Приложении, которую Пользователь должен заполнить для
            Регистрации в Приложении.
          </p>
        </section>
        <section>
          <h6>2. СБОР И ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ</h6>
          <p>
            1. Компания собирает и хранит только те Персональные данные, которые необходимы для предоставления
            возможности
            воспользоваться Платными услугами Платформы или Тренера и для полноценного взаимодействия с другими
            Пользователями.
          </p>
          <p>
            2. Компания будет сохранять ваши персональные данные в течение времени, необходимого для выполнения целей,
            изложенных в этой политике конфиденциальности, если более продолжительный срок хранения не требуется или не
            разрешен законом.
          </p>
          <p>3. Когда срок хранения данных для данного типа данных истечет, мы удалим или уничтожим их.</p>
          <p>4. Вы можете выполнить удаление ваших данных в приложении.</p>
          <p>2. Персональные данные могут использоваться для следующих целей:</p>
          <ul>
            <li>2.1. оказание платных услуг Клиенту;</li>
            <li>2.2. идентификация Пользователя;</li>
            <li>2.3. взаимодействие с Пользователем;</li>
            <li>2.4. направление Пользователю рекламных материалов, информации и запросов;</li>
            <li>2.5. проведение статистических и других исследований;</li>
            <li>2.6. обработка платежей Пользователя;</li>
            <li>2.7. мониторинг операций Пользователя с целью предотвращения мошенничества, незаконных ставок, отмывания
              денег.
            </li>
          </ul>
          <p>3. Компания также обрабатывает следующие данные:</p>
          <ul>
            <li>3.1. адрес электронной почты;</li>
            <li>3.2. фамилия, имя и отчество;</li>
          </ul>
          <p>4. Пользователю запрещено указывать в Приложении персональные данные третьих лиц.</p>
        </section>
        <section>
          <h6>3. ПОРЯДОК ОБРАБОТКИ ПЕРСОНАЛЬНЫХ И ДРУГИХ ДАННЫХ</h6>
          <p>
            Компания обязуется использовать Персональные данные в соответствии с Законом Республики Беларусь &quot;О
            защите
            персональных данных&quot; №99-3 от 07 мая 2021 года и внутренними документами Компании.
          </p>
          <p>
            2. В отношении Персональных данных и других данных Пользователя сохраняется их конфиденциальность, за
            исключением случаев, когда эти данные являются общедоступными.
          </p>
          <p>
            3. Компания вправе передавать Персональные данные и данные Пользователя без согласия Пользователя следующим
            лицам:
          </p>
          <ul>
            <li>
              3.1. государственным органам, в том числе органам дознания и следствия, и органам местного самоуправления по
              их мотивированному запросу;
            </li>
            <li>3.2. в иных случаях, прямо предусмотренных действующим законодательством Республики Беларусь.</li>
          </ul>
          <p>
            4. Компания вправе передавать Персональные данные и Данные третьим лицам, не указанным в пункте 3.4. настоящей
            Политики конфиденциальности, в следующих случаях:
          </p>
          <ul>
            <li>
              4.1. передача происходит в рамках продажи или иной передачи бизнеса (полностью или частично), при этом к
              приобретателю переходят все обязательства по соблюдению условий настоящей Политики;
            </li>
            <li>
              4.2. передача необходима в рамках использования Пользователем Приложения или оказания Платных услуг
              Пользователю;
            </li>
            <li>
              4.3. Пользователь выразил свое согласие на такие действия;
            </li>
          </ul>
          5. Компания осуществляет автоматизированную обработку Персональных данных и данных.
        </section>
        <section>
          <h6>4. ИЗМЕНЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h6>
          <p>
            1. Пользователь может в любой момент изменить (обновить, дополнить) Персональные данные, отредактировав свой
            профиль в Приложении, или направив письменное заявление в Компанию.
          </p>
          <p>2. Пользователь имеет право удалить Персональные данные в любой момент.</p>
          <p>3. Пользователь гарантирует, что все Персональные данные актуальны и не относятся к третьим лицам.</p>
        </section>
        <section>
          <h6> 5. ЗАЩИТА ПЕРСОНАЛЬНЫХ ДАННЫХ</h6>
          <p>
            1. Компания должным образом защищает Персональные и другие данные в соответствии с Законодательством и
            принимает необходимые и достаточные организационные и технические меры для защиты Персональных данных.
          </p>
          <p>
            2. Применяемые меры защиты, среди прочего, позволяют защищать Персональные данные от несанкционированного или
            случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных
            незаконных действий третьих лиц с ними.
          </p>
        </section>
        <section>
          <h6>6. ПРОЧИЕ ПОЛОЖЕНИЯ</h6>
          <p>
            1. К настоящей Политике конфиденциальности и отношениям между Пользователем и Компанией, возникающим в связи с
            применением Политики конфиденциальности, применяется право Республики Беларусь.
          </p>
          <p>
            2. Все возможные споры, возникающие из настоящего Соглашения, решаются в соответствии с применимым
            законодательством по месту регистрации Компании.
          </p>
          <p>
            3. До обращения в суд, Пользователь должен соблюсти обязательный досудебный порядок и направить
            соответствующую претензию в письменной форме Компании. Срок ответа на претензию составляет 30 (тридцать)
            рабочих дней.
          </p>
          <p>
            4. Если по каким-либо причинам одно или несколько положений Политики конфиденциальности будут признаны
            недействительными или не подлежащими исполнению, это не влияет на действительность или применимость остальных
            положений Политики конфиденциальности.
          </p>
          <p>
            5. Компания вправе в любое время изменять Политику конфиденциальности (в целом или в части) в одностороннем
            порядке без предварительного согласия Пользователя. Все изменения вступают в силу с момента их публикации на
            сайте по адресу <a href="https://www.fitassist.ru/">https://www.fitassist.ru/</a> и в Приложении.
          </p>
          <p>
            6. Пользователь обязуется самостоятельно следить за изменениями в Политике конфиденциальности путем
            ознакомления с актуальной версией.
          </p>
        </section>
        <section>
          <h6>7. КОНТАКТНАЯ ИНФОРМАЦИЯ КОМПАНИИ</h6>
          <p>1. Электронная почта: msait.evtushenko@gmail.com</p>
          <p>2. Адрес: 246032, Республика Беларусь, г. Гомель, ул. 50 лет БССР, 7, оф. 6</p>
        </section>
      </div>
    </main>
  )
}
